app/controllers/event_controller.rb

SELECT "tracks".* FROM "tracks"  ORDER BY "tracks"."order" ASC
SELECT "events".* FROM "events" WHERE (EXTRACT(DOY FROM start) = 90 and EXTRACT(YEAR FROM start) = 2016)
---
  def index
    params = date_params[:day] ? date_params : {day: Date.today.yday, year: Date.today.year}
    @date = Date.ordinal(params[:year].to_i, params[:day].to_i)
    @datePrev = "/?day=#{(@date - 1.day).yday}&year=#{(@date - 1.day).year}"
    @dateNext = "/?day=#{(@date + 1.day).yday}&year=#{(@date + 1.day).year}"
    events = Event.of_date(params)
    @tracks = Track.all.order(order: :asc)
    @time = ("07".."19").to_a.map{|h|
      ["00","15","30","45"].map{|m|
        "#{h}:#{m}"
      }
    }.flatten
    @trackEvents = []
    @tracks.each do |t|
      @trackEvents[t.id] = []
      events.each do |e|